[
  {
    "Name": "Helena Abadie",
    "Moment": "5 months ago",
    "Star": 5,
    "Text": "The school is amazing ! I cannot say enough about the staff .Ms. Linh is amazing!It truly is a family like environment. The instructors were always incredibly helpful and informative. Highly recommend attending!"
  },
  {
    "Name": "Rawand Abed al haq",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "as an esthetician student I highly recommend attending to 89 Beaty school , the instructors are very informative and helpful , it was a wonderful experience"
  },
  {
    "Name": "Lauren Callaway",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "I appreciate the education I receive from this establishment. The instructors are very knowledgeable and the overall class size provides an ample amount of one on one instruction opportunities upon student request. This establishment provides a solid foundation, however, as with everything, requires personal drive, discipline, and study. Read the materials and the instructors will further expand on the subject matter. Flexibility in gaining hours and experience is what sets this place apart from other establishments that have more of a strict structure. As the saying goes “You get out what you put in.”"
  },
  {
    "Name": "D-ana Hernandez",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "Attending 89 Beauty school has been a great experience. Very flexible with time which is very important to me especially being a parent. #eyelashtech"
  },
  {
    "Name": "Jessica Leal",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "This school is amazing, all the teachers are very helpful. Esthetics class is really fun and you get to learn a lot. The environment is just amazing!"
  },
  {
    "Name": "Tk Tk",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "The school is amazing ! I cannot say enough about the staff - Ms. Linh, Ms. Jessie, Ms. Annette ...everyone is amazing! They all exude such excitement and concern for each of us students- everyday you come you always feel so welcomed ! I love how it feels more like family atmosphere - the instructors genuinely want to see you progress, learn and complete each task, assignment , as they push you along sternly, but in love ❤️ attending this school was one of the best decisions I've made!"
  },
  {
    "Name": "bbydey",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "As a student that’s been coming to 89 beauty school, it has truly been amazing coming here! All of the teachers are very kind, considerate, and understanding. I’ve learned so much more than I had thought I was going to, in addition with gaining knowledge to have my own business. This school is definitely one of the best and I would recommend to anyone that’s interested in cosmology or esthetics!"
  },
  {
    "Name": "Nayah",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "I’m a new student and I love how motivating the instructors are here. Such a great environment to learn in!"
  },
  {
    "Name": "Alicia Deluna",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "This school has flexible class frames for accommodating which fit you best. #ManicuristProgram"
  },
  {
    "Name": "Sabrina Vong",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "Currently attending 89 beauty school in the cosmetology program, the hours are flexible and the teachers are super nice and helpful."
  },
  {
    "Name": "Maely Ramirez",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "Miss Lynn is the best she is always available for you and explain every little detail until you understand! Very pleasant environment. Every day I learn something new and that’s the best part!"
  },
  {
    "Name": "danna aragon",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "89 beauty school offers great services for a low price and the classes are good for anybody trying to pursue a career in the beauty industry."
  },
  {
    "Name": "yelitza medrano",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "89 beauty school has been amazing so far! Great environment and always feel welcomed"
  },
  {
    "Name": "Kayla Lopez",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "Amazing beauty school! Friendly and helpful staff."
  },
  {
    "Name": "Matthew Ruesch",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "As a current cosmetology student here, my experience has been fantastic. Compared to hearing experiences at other schools, 89 Beauty School prepares its students not only to pass the state board exam, but also ensures they are ready to deal with clients in the real world with hands on experience and offering time for more advanced techniques."
  },
  {
    "Name": "Audrey Turner",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "I’ve recently started within the last month but I have learned so much. I like that the classes are small so the instructor has an easier time answering questions. Mrs. Jessie is so knowledgeable on being an esthetician. She adjusts her teaching to how you may personally learn so that she can make sure you’re understanding the practical training and the book work. My class mates are also great. They’re willing to help and answer questions. They’ve made me feel so welcome. So far I’m enjoying my time at 89 Beauty ❤️"
  },
  {
    "Name": "Cynthia Eadeh",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "Very flexible schedule. Fun, friendly environment."
  },
  {
    "Name": "Steph",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "I’m a student at 89 beauty school, i love the teachers here they’re very direct and helpful when you ask for help. Very straight to the point."
  },
  {
    "Name": "Noemy",
    "Moment": "8 months ago",
    "Star": 5,
    "Text": "Amazing school with great instructors! Love how thorough they are with the lessons, and how much they motivate us!"
  },
  {
    "Name": "Ombrea",
    "Moment": "9 months ago",
    "Star": 5,
    "Text": "Attending 89 has been a journey but I loved every bit of it! Mrs. Lihn & all the instructors are super sweet and understandable. I’m glad for my experiences and everyone I have met along the way!"
  },
  {
    "Name": "Meagan Valdez",
    "Moment": "9 months ago",
    "Star": 5,
    "Text": "Amazing nail technician course!! Everyone gets along in every class. I have made wonderful new friends. Mrs.Lihn is very knowledgeable and I feel confident in everything she teaches me."
  },
  {
    "Name": "Kelli Leonard",
    "Moment": "9 months ago",
    "Star": 5,
    "Text": "This school is amazing!!!! From the students to the instructors! They are all so understanding and have helped me in countless ways the girls at the school are so kind and welcoming💖💖"
  },
  {
    "Name": "Kirsten Green",
    "Moment": "9 months ago",
    "Star": 5,
    "Text": "89 beauty school is very highly quality and everyone here is very respectful ,and kind so you should come and visit us to see if you would like it here."
  },
  {
    "Name": "Liliana Ciccia",
    "Moment": "9 months ago",
    "Star": 5,
    "Text": "It’s a good school."
  },
  {
    "Name": "Juana Loredo",
    "Moment": "a year ago",
    "Star": 5,
    "Text": "It’s an amazing school everybody is amazing especially all the instructors throughout my time here. Definitely recommend coming here you will love it!"
  },
  {
    "Name": "Evelin Ramirez",
    "Moment": "a year ago",
    "Star": 5,
    "Text": "As a graduated student at 89 beauty school it was a great experience. The students/staff always made me feel so welcomed. It truly is a family like environment. The instructors were always incredibly helpful and informative. Highly recommend attending!"
  },
  {
    "Name": "Ashley Benton",
    "Moment": "a year ago",
    "Star": 5,
    "Text": "Attending 89 beauty school following my passion for nails; I thought I knew it all but this school showed me there is so much more to “just doing nails”. The instructors are all so helpful, when asking questions they usually have an answer and if they don’t they will help you figure it out! They do what they can to help everyone feel comfortable in the environment and help prepare for test so that you are confident when the time comes. Although 89 beauty school offers different beauty programs everyone feels like one big family! With the things I have learned in class, networking with other students, and hands on with walk-in/call-in guests we service, I feel confident and ready for state boards and to work full time in the nail industry.!! I’m so happy and grateful that I attended 89 beauty school!!"
  },
  {
    "Name": "Yvonne Ruvalcaba",
    "Moment": "a year ago",
    "Star": 5,
    "Text": "89 Beauty was an amazing experience for me personally they treated me like family. Welcomed me with open arms and gave me the opportunity to become a great student. Highly recommend!"
  },
  {
    "Name": "Monica A",
    "Moment": "a year ago",
    "Star": 5,
    "Text": "Going to miss my teachers and classmates, had great time learning with them -manicurist."
  },
  {
    "Name": "Sophia Solano",
    "Moment": "a year ago",
    "Star": 5,
    "Text": "i got my nails done with a friend and they were absolutely perfect!!! i've never been more happy with a set of acrylics. definitely going again."
  },
  {
    "Name": "Sonia Hernandez",
    "Moment": "a year ago",
    "Star": 5,
    "Text": "I am happy to say that she did a great job! They are very professional and not to mention the prices! I will be back soon."
  },
  {
    "Name": "Sonia Hernandez",
    "Moment": "a year ago",
    "Star": 5,
    "Text": "I am happy to say that she did a great job! They are very professional and not to mention the prices! I will be back soon."
  }
]