[
  {
    "Name": "Winnie Wagner",
    "Moment": "",
    "Star": 5,
    "Text": "My 1st time there, and the staff was very welcoming. My tech was very knowledgeable and caring, bc my old set was a hot mess. I will definitely be going back for my fill ins. Thank you to all the staff for a job well done!!!!"
  },
  {
    "Name": "Judy Beck",
    "Moment": "",
    "Star": 5,
    "Text": "I found the best nail place in Pasadena."
  },
  {
    "Name": "Iluvmyself Chowww",
    "Moment": "",
    "Star": 5,
    "Text": "Love the experience here, the people here are so friendly otherwise I get my nails done here a lot and it is worth the money, absolutely recommended it!!!"
  },
  {
    "Name": "Angel a",
    "Moment": "",
    "Star": 5,
    "Text": "Nice service, good place, new boss maybe 4 months. I like how they do the simple pedicure.I am satisfied with the service. Very modern, highly responsive presentation and color scheme and offers great water bottles."
  },
  {
    "Name": "kd 1n",
    "Moment": "",
    "Star": 5,
    "Text": "Newly renovated, and I love the new owner (Selena) she’s really nice and sweet, and she’s really doing a great job doing my nails. 10/10 I recommend this place!"
  },
  {
    "Name": "Lena DiFatta",
    "Moment": "",
    "Star": 5,
    "Text": "I had a great experience at this nail salon. Despite a initial hiccup with my nails, the owner personally fixed them, ensuring I left satisfied. They even gave me a certificate for any inconvenience. I'll definitely be returning and recommend you do too!"
  },
  {
    "Name": "Amanda Colbert- Arold",
    "Moment": "",
    "Star": 5,
    "Text": "Fantastic!!! Did my nails one day and brought my daughter back next day. Very friendly and nails look great."
  },
  {
    "Name": "Galena Deters",
    "Moment": "",
    "Star": 5,
    "Text": "Awesome service. They are very nice and accommodating. We are new to the area and have been looking for a new nail place and I think we found a winner! Great work as well as a great atmosphere."
  },
  {
    "Name": "Angela Acampora",
    "Moment": "",
    "Star": 5,
    "Text": "I got a fill and a really cute design. The new owners are so friendly and welcoming and the salon is newly renovated. So glad I found my new go-to nail place!"
  },
  {
    "Name": "Yancy Cobb",
    "Moment": "",
    "Star": 5,
    "Text": "This place is under new ownership, and they are GREAT! The place have been remodeled and looks amazing. The service was great. A+++"
  }
]