[
  {
    "Name": "Porsche Campbell",
    "Moment": "",
    "Star": 5,
    "Text": "<p>Amazing atmosphere and staff. Came at a busy time but they still were quick and efficient. I'm not from Houston, but will definitely visit this nail salon when I return!</p>"
  },
  {
    "Name": "Andrea Perez",
    "Moment": "",
    "Star": 5,
    "Text": "<p>Love Nikki , she is amazing at what she does and love my nails every time I leave from there ❤️. 10/10</p>"
  },
  {
    "Name": "Rebecca Vega",
    "Moment": "",
    "Star": 5,
    "Text": "<p>Tia did my hands and Kathy did my toes, they both were amazing! I’ll definitely be returning. :)</p>"
  },
  {
    "Name": "Emanuel Ho",
    "Moment": "",
    "Star": 5,
    "Text": "<p>Nice salon and nails tech <br/>They do really good</p>"
  },
  {
    "Name": "Nina Austin",
    "Moment": "",
    "Star": 5,
    "Text": "<p>Le Bijou is a nice relaxing salon but my favorite part is my nail tech Tia Jones!  She's an amazing and creative professional who never ceases to amaze me when I walk out of the salon!   Her designs are unique and I always get compliments on my nails!</p>"
  },
  {
    "Name": "Annie Hyman",
    "Moment": "",
    "Star": 5,
    "Text": "<p>Gorgeous setting , good customer service, friendly staff and fair prices . I recommend giving them a try for your nail care needs! They also provide other services such as makeup, hair extensions etc. Very diverse group with much talent! I will definitely be returning in 2 weeks!</p>"
  },
  {
    "Name": "Patricia Quintanilla",
    "Moment": "",
    "Star": 5,
    "Text": "<p>Awesome! <br/>Friendly employees and clean establishment. <br/>Very relaxing atmosphere.</p>"
  },
  {
    "Name": "Judith Shulman",
    "Moment": "",
    "Star": 5,
    "Text": "<p>There's nothing gendered about a pedicure. Everyone can enjoy some foot loving. </br>Kathy was great. So soothing and pampered. <br/>Highly recommended.</p>"
  },
  {
    "Name": "Caroline Mime",
    "Moment": "",
    "Star": 5,
    "Text": "<p>I had the best experience at Le Bijou Nails And Spa Best acrylic set I've ever gotten They make you feel so relaxed and welcome like you are a regular even if your not. The salon offers convenient appointment scheduling options, allowing customers to book their preferred time slot easily. Very comfortable and staff was amazing, didn’t know exactly what I wanted but was treated like family, they were patient with me and was an excellent experience.</p>"
  },
  {
    "Name": "Ellie Baker",
    "Moment": "",
    "Star": 5,
    "Text": "<p>I refuse to go anywhere else!! I know a quality manicure when I see one and I searched the Galleria area for 2 years with no luck. That was until I found Nikki’s team at Le Bijou. They are quick, prices are great and the service is unmatched!</p>"
  }
]