[
  {
    "Name": "Alzaben A Enam",
    "Moment": "10/16/2019",
    "Star": 5,
    "Text": "Keep up the good job I recommend it to all my family and friends I loved it",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": true
  },
  {
    "Name": "Jacqueline Hale",
    "Moment": "10/14/2019",
    "Star": 5,
    "Text": "Vicki is great she took her time to teach me. She’s not only a great teacher but a kind person and wants nothing but success for her students. If you’re looking for someone who will help you grow your talent I recommend her! THANK YOU SO MUCH FOR YOUR KINDNESSES AND GENEROUS HEART! I will be back for another class.",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": true
  },
  {
    "Name": "Gina Bender",
    "Moment": "09/12/2019",
    "Star": 5,
    "Text": "I love my new eyebrows! Rose ( who did mine and Vicky the sweet lady owner)did a good job! All the staff are friendly and very accommodating! Hightly recommended for ladies who wants to be more confident beautiful! I rate them 100%!",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": true
  },
  {
    "Name": "Tyree Kizzy",
    "Moment": "09/10/2019",
    "Star": 5,
    "Text": "This lady is the best!!! She is Professional understanding just the best!! Her work is amazing!! I wouldn’t go anywhere else ever!!! I did kick-eyebrows and love them. I walked in to work & everyone asked me where did I go. They have appointments now with Vicki!!",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": true
  },
  {
    "Name": "Kimberly Andrews",
    "Moment": "07/12/2019",
    "Star": 5,
    "Text": "I recently had my brows micro bladed. The result was fantastic! I experienced minimal pain in the beginning. However, once the skin was broken that minimal pain subsided immediately. I even fell asleep during the procedure. Ms. Le took great care to precisely map the brow area before beginning the micro blading. The place was comfortable and conveniently located in downtown Oak Lawn. Ms. Le is very kind and skilled at what she does. I recommend her services to everyone! <br/>You should be very happy with the service you receive. I most definitely am! Make your appointment today!",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Jenny Macaso",
    "Moment": "06/14/2019",
    "Star": 5,
    "Text": "Vicky did a really good job with my eyebrows. Beautiful!!",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Jay Levii",
    "Moment": "06/13/2019",
    "Star": 5,
    "Text": "I love Vicky and Nu You Spa! Such an amazing experience and overall very professional. My micro-shading eyebrows are amazing! :) Thank you Vicky and staff!",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Brittany Humphrey",
    "Moment": "05/19/2019",
    "Star": 5,
    "Text": "Love Vicky and Nu You Spa! Vicky is professional, friendly, and knowledgeable when it come to the latest beauty techniques, keeping her skills on point. She ensures you have a relaxing, satisfying experience. Her products and routine have improved my facial “glow” including enhancing with the ombré shaded eyebrows (so many compliments!) I will definitely continue with Nu You Spa and recommend for self-care pampering.",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Dorotka Stokrotka",
    "Moment": "05/13/2019",
    "Star": 5,
    "Text": "Vicky was wonderfull she did just what i expected and more im very happy with my new eyebrows, I'll recommend Nu you spa to all my friends and ppl i know im extremely happy with the results, ill go back any time for anything i need done on my face 100%",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Cheri Thoman",
    "Moment": "05/03/2019",
    "Star": 5,
    "Text": "very clean,relaxing professional place had ombre shading done by Vicky she does her best to be sure her customers are satisfied with her services great prices, great specials on her services would Recommend Nu you spa to anyone looking to get pampered will be going to her salon for my future services",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Yolanda McDonald",
    "Moment": "04/28/2019",
    "Star": 5,
    "Text": "I am so pleased with the services that I get from Vicky. I have been coming to her for over a year for my nails, brows, and lashes. I am an extremely picky person about my services. In addition, I have a highly professional job where my appearance is extremely important and Vicky keeps me looking good. She stands behind her work and provides a high quality of work and good products. She is passionate about her work and strives to make sure you are satisfied. Further, she keeps her skills current and can always do the latest techniques. Lastly, she is very clean and provides friendly customer service; I am always highly satisfied when I leave.",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Kemberlyn Skinner",
    "Moment": "04/06/2019",
    "Star": 5,
    "Text": "I Love not having to get up early in the morning doing my eyebrows, Thank You Vickey I will recommend anyone that I come into contact with",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Vui Le",
    "Moment": "04/04/2019",
    "Star": 5,
    "Text": "Professional place ! highly recommend it",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Vivian Nguyen",
    "Moment": "02/10/2018",
    "Star": 5,
    "Text": "good job, great service.",
    "TabIndex": 1,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Yolanda McDonald",
    "Moment": "",
    "Star": 5,
    "Text": "I am so pleased with the services that I get from Vicky. I have been coming to her for over a year for my nails, brows, and lashes. I am an extremely picky person about my services. In addition, I have a highly professional job where my appearance is extremely important and Vicky keeps me looking good. She stands behind her work and provides a high quality of work and good products. She is passionate about her work and strives to make sure you are satisfied. Further, she keeps her skills current and can always do the latest techniques. Lastly, she is very clean and provides friendly customer service; I am always highly satisfied when I leave.",
    "TabIndex": 2,
    "Position": 1,
    "IsHome": true
  },
  {
    "Name": "Kissy Rivera",
    "Moment": "",
    "Star": 5,
    "Text": "Vicki is the best she is sweet professional & Understanding. I was nerves and she made sure I was Comfortable.",
    "TabIndex": 2,
    "Position": 1,
    "IsHome": true
  },
  {
    "Name": "Vero Nica",
    "Moment": "",
    "Star": 5,
    "Text": "I was going to be one of the models for certifying technicians, but I had a family emergency. My friend took my place and I was so jealous, they looked fabulous! I can tell that Vicky Le is a very serious business woman who makes sure her customers leave feeling satisfied with her work. (Check out her lash and microblading work.) I highly recommend going to her!",
    "TabIndex": 2,
    "Position": 1,
    "IsHome": true
  },
  {
    "Name": "Yazmin Ramos",
    "Moment": "",
    "Star": 5,
    "Text": "Awesome work! Had microblading done. Very satisfied! Before I had the opportunity to ask, owner presented her license, photos of clients and explained the process. She requested that I come back a week later to monitor the healing process. She takes her work seriously! I highly recommend this place!",
    "TabIndex": 2,
    "Position": 1,
    "IsHome": true
  },
  {
    "Name": "Cheri Thoman",
    "Moment": "",
    "Star": 5,
    "Text": "I had ombre shading done by Vicky she is passionate about her work she makes sure you are satisfied with your services done by her very clean,calm,relaxing environment i will be going to her for my future services I Highly recommend Nu You spa to anyone looking to pamper themselves great prices💲 and specials on her services...",
    "TabIndex": 2,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Jennifer Huggins",
    "Moment": "",
    "Star": 5,
    "Text": "Professional, private and friendly service . I have been seeing Vicky for years, for nail care and waxing. With her new spa she is able to care for all my beauty needs including customizing my facials and skin care to fit my needs. I also had microblading and eyelashes done here. Vicky stands by her work, uses leading technology and always enhancing my experience with the latest treatments. The spa is clean, with relaxing and soothing music. She has been reliable and flexible with my appointment needs. I would highly recommend.",
    "TabIndex": 2,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Lhill",
    "Moment": "",
    "Star": 5,
    "Text": "Vicky is super attentive and very accommodating! I am constantly getting compliments on my lashes and nails! She has a very relaxing and well maintained salon.",
    "TabIndex": 2,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Rose Marshall",
    "Moment": "",
    "Star": 5,
    "Text": "Wow what an experience! I was very nervous about this microblading project but Vicky Le was very reassuring. My eyebrows are beautiful but it will take time for me to get used to seeing the new me! Vicky Le was very professional and knowledgeable about mcroblading process.",
    "TabIndex": 2,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Don Coday",
    "Moment": "",
    "Star": 5,
    "Text": "Amazing, loved everything relaxing moment with miss vicky, shes the best...",
    "TabIndex": 2,
    "Position": 1,
    "IsHome": false
  },
  {
    "Name": "Florence Johnson",
    "Moment": "",
    "Star": 5,
    "Text": "Get ready to be pampered.",
    "TabIndex": 2,
    "Position": 1,
    "IsHome": false
  }
]