[
  {
    "Thumbnail": "/Content/images/google-clients/google-client-1.png",
    "Title": "Michelle",
    "Date": "April 29, 2023",
    "Comment": "<p>Such a great experience! Everyone was so friendly and welcoming. I'm in love with my nails <img draggable=\"false\" role=\"img\" class=\"img-text\" alt=\"😍\" src='https://s.w.org/images/core/emoji/14.0.0/svg/1f60d.svg'> Thank you My!<p>",
    "Position": 1
  },
  {
    "Thumbnail": "/Content/images/google-clients/google-client-2.png",
    "Title": "B",
    "Date": "April 24, 2023",
    "Comment": "<p>I absolutely love this nail salon!! They have the best customer service that I’ve ever experienced. Mye is so so so good at shaping my nails perfect every time. She is extremely detail oriented and is hands<span class=\"dots\">...</span><span class=\"more\"> down *the best* tech! I’ve never had a bad pedicure here, they are always so good and make me so relaxed and happy. I also absolutely adore Brian and Lolly at the front. They are super kind and attentive. If I could give them all 100 stars, I would. Thanks for always being so consistent and amazing!</span></p><p><button onclick=\"readmore(this)\" class=\"btn btn-link btn-read-more\">Read more</button></p>",
    "Position": 2
  },
  {
    "Thumbnail": "/Content/images/google-clients/google-client-4.png",
    "Title": "Kate G",
    "Date": "April 20, 2023",
    "Comment": "<p>I love getting my lashes done here by Jason. He is so kind & great at communicating! Definitely recommend.</p>",
    "Position": 3
  },
  {
    "Thumbnail": "/Content/images/google-clients/google-client-4.png",
    "Title": "April Ralston",
    "Date": "April 19, 2023",
    "Comment": "<p>Love love this spot! Jason does amazing lashes if you need a spot. Nail art is always carefully done too. Super chill environment too. Definitely recommend <img draggable=\"false\" role=\"img\" class=\"img-text\" alt=\"🤗\" src='https://s.w.org/images/core/emoji/14.0.0/svg/1f917.svg'></p>",
    "Position": 4
  },
  {
    "Thumbnail": "/Content/images/google-clients/google-client-5.png",
    "Title": "KYLA WALKER",
    "Date": "April 19, 2023",
    "Comment": "<p>I HAD THE BEST EXPERIENCE WITH MS. KIM <img draggable=\"false\" role=\"img\" class=\"img-text\" alt=\"❤\" src='https://s.w.org/images/core/emoji/14.0.0/svg/2764.svg'> SHE WAS SO ATTENTIVE AND GAVE THE BEST MASSAGES HANDS DOWN. IT FELT EUPHORIC AND I WILL DEFINITELY BE BACK FOR THE FULL SPA<span class=\"dots\">...</span><span class=\"more\"> EXPERIENCE WITH HER. TIM NEVER DISAPPOINTS ON TGE NAILS OF COURSE.</span></p><p><button onclick=\"readmore(this)\" class=\"btn btn-link btn-read-more\">Read more</button></p>",
    "Position": 5
  },
  {
    "Thumbnail": "/Content/images/google-clients/google-client-6.png",
    "Title": "Katie Ramirez-Portillo",
    "Date": "April 19, 2023",
    "Comment": "<p>love this salon!! the best in oak lawn <33 very friendly staff, my nails always come out amazing! i’ve been coming here for almost 2 years, they always do a great job - kristy did my nails today</p>",
    "Position": 6
  },
  {
    "Thumbnail": "/Content/images/google-clients/google-client-7.png",
    "Title": "Anonymous Anonymous",
    "Date": "April 16, 2023",
    "Comment": "<p>Wow!! First time here and they did not disappoint. I have literally NEVER been so happy with my experience at a nail salon. We were greeted at the front desk so kindly. They immediately asked us if we<span class=\"dots\">...</span><span class=\"more\"> wanted a drink and got us situated. Found out the guy who greeted us so warmly at the front desk was the owner! They said he knows everybody by name. How awesome is that he takes the time to know his customers. My nails and toes were PERFECT!!! I showed a pic of the nails I wanted..I told the guy he didn’t have to do it exactly like the photos because I’ve never been able to get my nails exactly like the photos I show but heh kept asking to see it because he was getting as close to the photo as possible. In the end, he did better!!!! My favorite part was getting my lash extensions. I didn’t go in expecting to get my lashes done. I have never done it because I am very picky. I see other people’s work and I think it’s good but I don’t think it would look good on me. I wanted natural but noticeable. When I went in he did a quick consultation. He let me bring my 10 month old baby in her car seat back in his little room and talked to her while he did my lashes for about an hour and 15 minutes. He was so gentle and so kind. I will for sure be back. This is my nail salon for life and I will 100% refer everyone I know here!!!</span></p><p><button onclick=\"readmore(this)\" class=\"btn btn-link btn-read-more\">Read more</button></p>",
    "Position": 7
  }
]
